#Книжные магазины предлагают следующие коллекции книг Магистр – Лермонтов, Достоевский, Пушкин, Тютчев ДомКниги – Толстой, Грибоедов, Чехов, Пушкин. БукМаркет – magistr = {"Лермонтов", "Достоевский", "Пушкин", "Тютчев"}
dom_knigi = {"Толстой", "Грибоедов", "Чехов", "Пушкин"}
bookmarket = {"Пушкин", "Достоевский", "Маяковский"}
galereya = {"Чехов", "Тютчев", "Пушкин"}
required = {"Достоевский", "Пушкин"}

shops = {"Магистр": magistr, "ДомКниги": dom_knigi, "БукМаркет": bookmarket, "Галерея": galereya}
result = [name for name, books in shops.items() if required.issubset(books)]

print("Магазины:", ", ".join(result) if result else "Нет таких магазинов")
